7_Part_B/7_Master/data/calico_20260418_181425_hey.txt
# AI Declaration: This script skeleton was generated with AI assistance and must be reviewed by the team.


Summary:
  Total:	0.3051 secs
  Slowest:	0.2107 secs
  Fastest:	0.0013 secs
  Average:	0.0044 secs
  Requests/sec:	1638.8616
  

Response time histogram:
  0.001 [1]	|
  0.022 [496]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.043 [0]	|
  0.064 [0]	|
  0.085 [0]	|
  0.106 [0]	|
  0.127 [0]	|
  0.148 [0]	|
  0.169 [0]	|
  0.190 [0]	|
  0.211 [3]	|


Latency distribution:
  10% in 0.0016 secs
  25% in 0.0021 secs
  50% in 0.0031 secs
  75% in 0.0039 secs
  90% in 0.0049 secs
  95% in 0.0055 secs
  99% in 0.0080 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0013 secs, 0.2107 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0033 secs, 0.0005 secs, 0.2085 secs
  resp read:	0.0006 secs, 0.0003 secs, 0.0035 secs

Status code distribution:
  [200]	500 responses