7_Part_B/7_Master/data/cilium_20260418_193035_hey.txt
# AI Declaration: This script skeleton was generated with AI assistance and must be reviewed by the team.


Summary:
  Total:	0.3748 secs
  Slowest:	0.2109 secs
  Fastest:	0.0024 secs
  Average:	0.0054 secs
  Requests/sec:	1334.1376
  

Response time histogram:
  0.002 [1]	|
  0.023 [495]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [0]	|
  0.065 [0]	|
  0.086 [0]	|
  0.107 [0]	|
  0.128 [0]	|
  0.148 [0]	|
  0.169 [0]	|
  0.190 [0]	|
  0.211 [4]	|


Latency distribution:
  10% in 0.0030 secs
  25% in 0.0032 secs
  50% in 0.0035 secs
  75% in 0.0040 secs
  90% in 0.0048 secs
  95% in 0.0055 secs
  99% in 0.0079 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0024 secs, 0.2109 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0033 secs, 0.0008 secs, 0.2083 secs
  resp read:	0.0012 secs, 0.0006 secs, 0.0036 secs

Status code distribution:
  [200]	500 responses