7_Part_B/7_Master/data/flannel_20260418_191631_hey.txt
# AI Declaration: This script skeleton was generated with AI assistance and must be reviewed by the team.


Summary:
  Total:	0.3670 secs
  Slowest:	0.2095 secs
  Fastest:	0.0024 secs
  Average:	0.0052 secs
  Requests/sec:	1362.4648
  

Response time histogram:
  0.002 [1]	|
  0.023 [495]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [0]	|
  0.065 [0]	|
  0.085 [0]	|
  0.106 [0]	|
  0.127 [0]	|
  0.147 [0]	|
  0.168 [0]	|
  0.189 [0]	|
  0.210 [4]	|


Latency distribution:
  10% in 0.0029 secs
  25% in 0.0031 secs
  50% in 0.0034 secs
  75% in 0.0038 secs
  90% in 0.0045 secs
  95% in 0.0050 secs
  99% in 0.0105 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0024 secs, 0.2095 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0032 secs, 0.0008 secs, 0.2064 secs
  resp read:	0.0011 secs, 0.0005 secs, 0.0037 secs

Status code distribution:
  [200]	500 responses